Autodesk.Revit.UI.UIThemeManager.CurrentCanvasTheme
current canvas theme.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.UI.UIThemeManager.FollowSystemColorTheme
Indicate if the overall theme follows operating system color theme.
Since:
2024

Autodesk.Revit.UI.UIThemeManager.CurrentTheme
The current overall theme which impacts the Revit frame and canvas.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.UI.UIThemeManager.GetCurrentFrameBackgroundColor
Return the frame background color from the given theme.
Since:
2014

Autodesk.Revit.UI.UIThemeManager.GetThemeName(Autodesk.Revit.UI.UITheme)
Gets the theme name for the given theme type.
frameTheme:
The theme.
Returns:
The name of the theme.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.UI.UIThemeManager
Manager object for the UITheme class.
Since:
2014